# DirectShapeFailures Properties

---
The BuiltInFailuresDirectShapeFailures type exposes the following members.
| Name| Description
---|---|---
| CannotCreateDirectShapeOrTypeDocumentCorruption|  Cannot create a DirectShape or DirectShapeType.
| CannotCreateDirectShapeOrTypeError|  Cannot create a DirectShape or DirectShapeType.
| CannotCreateDirectShapeOrTypeWarning|  Cannot create a DirectShape or DirectShapeType.
| CannotCreateDirectShapeRefsWarning|  Cannot create reference objects for a DirectShape.
| CannotCreateDirectShapeTypeRefsWarning|  Cannot create reference objects for a DirectShapeType.
Top
#### Reference
BuiltInFailuresDirectShapeFailures Class
Autodesk.Revit.DB Namespace